quest_system_1462354691_name=^?^Dragons' Labyrinth
quest_system_1462354691_stage_0=^?^Deliver the letter from Violetta to the king of dwarves, Torn Digor.
quest_system_1462354691_stage_1=^?^Go to Mehgard and speak to the chief engineer, Debat.
quest_system_1462354691_stage_2=^?^The key to the Dragons' Labyrinth is somewhere in the Land of Demons. You are to pass through the Magic Portal to Demonis and recover the key.
quest_system_1462354691_stage_3=^?^Find the key to the labyrinth. No doubt the key is in one of the two castles, either Nexy or Magnis.
quest_system_1462354691_stage_4=^?^You have recovered the key. Now you must open the Dragons' Labyrinth. The entrance to the labyrinth is in the east of the Valley of a Thousand Rivers.
quest_system_1462354691_stage_5=^?^Proceed through the labyrinth to Murock.
quest_system_1462354691_task=^?^Queen Violetta reports that the orcs had taken Amelie to Murock. You can reach Murock through the Dragons' Labyrinth, but the labyrinth is closed.<br>The dwarves closed the labyrinth and only they can open it again. You must enlist the help of the king of dwarves, Torn Digor, and open the labyrinth to reach Murock.<br>[reward]
